[XEN_BladeDancer X2SoldierClassTemplate]
+DisplayName="战舞者"
+ClassSummary="当你用你的小手枪在靶场上时，我正在研究剑术。当你沉迷于手榴弹时，我已经掌握了完美的招架技巧。当你浪费时间寻找火焰喷射伏击的最佳位置时，我已经与阴影融为一体。现在世界正向我们求救，希望摆脱外星人大军的压迫，而你竟然有胆量来寻求我的帮助？"
+LeftAbilityTreeTitle="无尽华尔兹"
+RightAbilityTreeTitle="旋转舞步"
AbilityTreeTitles[0]="无尽华尔兹"
AbilityTreeTitles[1]="神秘舞曲"
AbilityTreeTitles[2]="暗影之舞"
AbilityTreeTitles[3]="XCOM"

+RandomNickNames[0]="Kenpachi"
+RandomNickNames[1]="Hitokiri Battousai"
+RandomNickNames[2]="Shinobi"
+RandomNickNames[3]="Assassin"
+RandomNickNames[4]="Bladesinger"
+RandomNickNames[5]="Hidden Blade"
+RandomNickNames[6]="Mugetsu"
